Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །འཕྲུལ་དགར་ཟླ་བ་ཟླ་བཟངས་འདྲ་བ་ཡི། །མེ་ཏོག་མན་དཱར་ཕྲེང་དང་བྱུག་པ་འབེབས།
en: In the realm of the Nirmāṇarati gods, garlands of mandārava flowers Resembling the moon, a sucandra jewel, and unguent oils rain down.

source: །དགའ་ལྡན་གནས་སུ་ནོར་བུ་ཆེན་པོའི་མདོག །རྒྱན་གྱི་དམ་པ་རིན་ཆེན་སྣ་ཚོགས་དང་། །གཙུག་གི་ནོར་བུ་ཟླ་བ་འདྲ་བ་དང་། །གསེར་མདོག་འདྲ་བའི་དར་ལའི་ཆར་ཡང་འབེབས།
en: “ ‘In the realm of the Tuṣita gods, showers of various jewels, The best of ornaments, the color of great jewels, Crest ornaments resembling moons, and Fine cloth resembling a golden hue rain down.

source: །རྒྱལ་མཚན་གདུགས་དང་བ་དན་སྣ་ཚོགས་དང་། །ཕྲེང་བ་རྣམས་དང་རྒྱན་དང་བྱུག་པ་དང་། །མུ་ཏིག་དམར་དང་གསེར་དང་དར་ལ་དང་། །སིལ་སྙན་ཡིད་འོང་འཐབ་བྲལ་གནས་སུ་འབེབས།
en: “ ‘Showers of banners, parasols, and diverse flags, Garlands of flowers, ornaments, unguent oils, Red pearls, gold, and fine cloth Rain down with pleasant music in the realm of the Yāma gods.

source: །སུམ་ཅུ་གསུམ་དུ་ཡིད་བཞིན་ནོར་བུ་མཆོག
en: “ ‘Among the gods of the Trāyastriṃśa class there are the best wish-fulfilling gems,

source: །སྐྱོང་བའི་གནས་སུ་ཙན་དན་སྙིང་པོའི་མཆོག
en: And in the realm of the gods of the protector class, the best essence of sandalwood,

source: །གུར་གུམ་སིལ་མ་ལྷ་ཤིང་ཏ་མ་ལ།
en: Petals of saffron, the divine wood tamāla,

source: །སྤོས་ཆུའི་རྒྱུན་དང་མེ་ཏོག་རབ་ཏུ་འབེབས།
en: And showers of perfumed water and flowers fall.

source: །སྐྱོང་བའི་གནས་སུ་ཀླུ་ཡི་དབང་པོ་དེ།
en: “ ‘Also in the realm of the gods of the protector class, that ruler of nāgas

source: །ཉམ་སྟོབས་སྐྱེ་བའི་ཁ་ཟས་སྐོམ་གྱི་རྣམས། །ཁ་དོག་དྲི་ཞིམ་རོ་དང་ལྡན་པ་དང་། །དེ་མིན་རིན་ཆེན་བསམ་ཡས་ཆར་ཡང་འབེབས།
en: Causes showers of delicious and colorful foods with appetizing aromas For those hungry for strength-restoring food And causes inconceivable showers of jewels to rain down.

source: །དེ་ནི་རྒྱ་མཚོ་ཆེན་པོར་རྒྱུན་དུ་ཡང་།
en: “ ‘In the great ocean, for about as long as a yuga,

source: །ཆར་རྒྱུན་མི་འཆད་གཉའ་ཤིང་ཙམ་དག་དང་།
en: He continuously and unceasingly lets fall showers of rain,

source: །རྣམ་རྒྱལ་ཆེན་པོ་མཛོད་རྣམས་མི་ཟད་པ།
en: Great victory banners, inexhaustible treasuries,

source: །རིན་ཆེན་བཀོད་པ་མཐའ་ཡས་ཆར་ཡང་འབེབས།
en: And infinite arrays of precious decorations.

source: །མི་ཅི་གནས་སུ་རྒྱན་ཕྲེང་སྣ་ཚོགས་དང་། །པད་མ་ཨུད་པལ་རས་དང་རིན་ཆེན་དང་། །མེ་ཏོག་བར་ཤ་མ་ལི་ཕྱེ་མ་སྤོས།
en: “ ‘In the realm of kinnaras, he lets fall showers of various necklaces, White and blue lotuses, fabrics, jewels, Vārṣikī, mallikā flowers, scented powder, perfume,

source: །པི་བང་གླིང་བུ་སྒྲ་སྙན་རྫ་རྔ་འབེབས།
en: Vīṇās, flutes, lutes, and clay-pot drums.

source: །ཀླུ་ཡི་གནས་སུ་མུ་ཏིག་དམར་པོ་སྟེ།
en: “ ‘In the realm of nāgas, he showers down red pearls.

source: །གསང་བར་ནོར་བུ་རིན་ཆེན་སྐར་མདོག་འདྲ།
en: In the secret realm of gandharvas, it rains jewels with the colors of stars.

source: །ལྷ་མིན་གནས་སུ་རལ་གྲི་མདའ་ཆེན་དང་། །དགྲར་འདུལ་གཞུ་དང་སྟེའུ་ཀའི་ཆར་པ་འབེབས།
en: In the realm of asuras, it rains a shower of swords, arrows, bows for subduing enemies, and small axes.

source: །བྱང་དུ་དེ་ནི་རྒྱལ་ཕྲེང་རིན་ཆེན་དང་། །མེ་ཏོག་བར་ཤ་མ་ལི་ཙམ་པའི་ཕྲེང་།
en: “ ‘In the northern continent, he lets fall a rain of precious royal necklaces, Garlands made exclusively of vārṣikī and mallikā flowers,

source: །ཀུ་རན་གཙང་དང་ཨ་ཏི་མུག་ཏ་འབེབས།
en: And fruits of the karañja and atimukta trees.

source: །གླིང་གཞན་རྣམས་སུའང་སྣ་ཚོགས་ཆར་པ་འབེབས།
en: In the other continents, showers of various other things rain down.

source: །འཛམ་བུའི་གླིང་དུ་ཆུ་གསལ་དང་བ་ཡི།
en: “ ‘On this continent of Jambudvīpa, he lets fall clear, pure rain

source: །ཆར་རྣམས་ཆོས་བཞིན་ཕྲ་བའི་རྒྱུན་དུ་འབེབས།
en: In moderate amounts in accord with Dharma.

source: །མེ་ཏོག་འབྲས་བུ་སྨན་དང་སྤོས་དང་ཤིང་། །ལོ་ཏོག་བདེ་བྱེད་འཇིག་རྟེན་རྣམས་སུ་སྐྱེད།
en: He rains down flowers, fruits, medicinal herbs, perfume, wood, And pleasure-producing fruits for people in the world.

source: །དེ་ལྟར་སྤྲིན་བཀོད་བསམ་གྱིས་མི་ཁྱབ་དང་། །གློག་འབྱིན་འབྲུག་སྒྲོགས་བཀོད་པའི་ཆར་འབེབས་ཀྱང་།
en: “ ‘Thus, even though he creates the inconceivable cloud arrays And showers with lightning and thunder,

source: །གནས་ནས་མི་གཡོ་རྣམ་པར་རྟོག་པ་མེད། །ཀླུ་ཡི་རྣམ་འཕྲུལ་དེ་ལྟར་བསམ་མི་ཁྱབ།
en: He never moves from his place and has no conceptual thoughts— Thus, the magical projection of the nāga king defies comprehension.

source: །རྒྱ་མཚོའི་ཆུ་ན་གནས་པ་དེ་ལྟར་ཡང་། །ཀླུ་ཡི་རྣམ་འཕྲུལ་བསམ་ཡས་སྟོན་བྱེད་ན།
en: “ ‘Therefore, if he could project those nāga magical wonders, All the while dwelling in the waters of the ocean,

source: །ཆོས་ཀྱི་རྒྱ་མཚོར་ཞུགས་པའི་ཡོན་ཏན་ཕྱུག །རྣམ་འཕྲུལ་བསམ་ཡས་ཅི་ཕྱིར་སྟོན་མི་བྱེད།
en: Then why would those who are rich with the qualities gained through having entered The ocean of Dharma not be able to project inconceivable magical displays?

source: །བག་ཙམ་སྨོས་པའི་དཔེ་ཚུལ་འདི་དག་གིས།
en: “ ‘Through these trifling statements of comparison,

source: །སྐྱེས་ཆེན་དེ་དག་རྣམས་ཀྱི་བརྗོད་པ་བྱས།
en: An explanation of those great ones was made.

source: །དཔའ་བོ་དེ་དག་དཔེ་རྣམས་ཀུན་དང་བྲལ།
en: Those heroes are completely beyond all comparison.

source: །དེ་དག་དེ་འདྲའི་རྣམ་ཐར་དབང་བསྒྱུར་རོ། །
en: In this way they hold sway over liberation.

source: བློ་གྲོས་དམ་པ་བློ་གྲོས་རྒྱ་ཆེན་ལྡན། །མ་ནོར་བློ་གྲོས་མཐའ་ཡས་བློ་གྲོས་ཅན། །ཡེ་ཤེས་མཆོག་ལྡན་ཁྱད་པར་བློ་ཅན་གྱི། །རྣམ་ཐར་མཆོག་རྣམས་འདི་ལྟ་རྣམས་ཀྱིས་བཤད།
en: “ ‘The highest emancipation of one with the highest mind, possessing the highest gnosis— The highest intelligence, vast intelligence, Unfailing intelligence, and infinite intelligence—Is explained in this way.

source: །རྣམ་ཐར་དམ་པ་འདི་དག་སུས་ཐོས་ནས།
en: “ ‘Whoever, after hearing about this ultimate emancipation,

source: །ཡིད་ཆེས་འཛིན་ཅིང་འཇིག་རྟེན་སྒྲོག་བྱེད་པ།
en: Believes in it and announces it to the world,

source: །དེ་དག་ངོ་མཚར་རྨད་བྱུང་ཆོས་ལྡན་ཏེ།
en: Possesses a wonderful, marvelous Dharma teaching.

source: །དེ་དག་དགའ་བྱེད་མི་ཡི་འཇིག་རྟེན་ན།
en: “ ‘Among those in the world of humans to be gratified,

source: །འདི་འདྲའི་ཆོས་འདིར་གང་དག་དད་གྱུར་པ།
en: Whoever has faith in such a Dharma teaching as this

source: །སེམས་ཅན་སོ་སོའི་སྐྱེ་བོའི་ཚོགས་ན་དཀོན།
en: Is rare within the throng of ordinary sentient beings.

source: །གང་དག་དགེ་བསགས་བསོད་ནམས་བྱས་གྱུར་པ།
en: Whoever has accumulated virtue and done virtuous deeds

source: །དེ་དག་རྒྱུ་ཡི་སྟོབས་ཀྱིས་འདི་ལ་དད།
en: Will have faith in this, by way of a karmic cause.

source: །གང་དག་ཉན་ཐོས་ཐེག་པའང་ཡིད་ཆེས་པའི། །མི་དག་མི་ཡི་འཇིག་རྟེན་རྣམས་ན་ཉུང་།
en: “ ‘In the human world, humans with faith Are few even for the śrāvaka vehicle.

source: །དེ་བས་རྐྱེན་གྱི་ཐེག་པར་རབ་ཏུ་ཉུང་།
en: Fewer yet are those with faith in the conditioned vehicle,

source: །ཐེག་པ་ཆེན་པོར་དེ་དག་དེ་བས་ཉུང་།
en: While those with faith for the Mahāyāna are still fewer.

source: །ཐེག་པ་ཆེ་ལ་ཞུགས་པ་དེ་དཀོན་ཏེ།
en: “ ‘Those who have entered the Mahāyāna are rare,

source: །གང་དག་ཆོས་འདིར་དད་པའང་རབ་དཀོན་ན། །འཇུག་ཅིང་འཛིན་པ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: And if those with faith in this Dharma are very rare, It goes without saying that those who engage in it and uphold it are rarer still.

source: །གང་དག་དེ་བཞིན་སྒྲུབ་པ་སྨོས་ཅི་དགོས།
en: So what need be said of those who practice it?

source: །གང་དག་སྟོང་གསུམ་རི་དང་རྒྱ་མཚོར་བཅས། །ཕྱི་མའི་བསྐལ་པར་མགོ་བོས་འདེག་བྱེད་ཀྱང་། །ཆོས་འདིར་དད་པའི་བྱ་དཀའ་ཅི་འདྲ་བ། །དེ་འདྲ་དེ་ནི་དེ་ལ་ཡོད་མ་ཡིན།
en: “ ‘Even if in a later eon someone were to use their head To lift up the mountains and oceans of the billionfold universe, Such an undertaking would be nothing compared with The difficult task of having faith in this Dharma.

source: །ལ་ལས་སྟོང་གསུམ་རྡུལ་སྙེད་སེམས་ཅན་ལ། །བདེ་བ་ཀུན་གྱིས་བསྐལ་པར་བསྙེན་བཀུར་ཀྱང་།
en: “ ‘Though some people might, for an eon, serve sentient beings As numerous as the atoms of the billionfold universe,

source: །ཆོས་འདིར་དད་པའི་བསོད་ནམས་ཅི་འདྲ་བ།།བསོད་ནམས་ཁྱད་པར་དེ་འདྲ་དེ་ལ་མེད།
en: They would still not have merit comparable to That of having faith in this Dharma.

source: །ལ་ལས་ཞིང་བཅུ་རི་དང་རྒྱ་མཚོར་བཅས། །ལག་པའི་མཐིལ་དུ་བསྐལ་པར་མཁར་འཛིན་ཀྱང་།
en: “ ‘Even if someone were to hold in the palm of his hand a fortress Made of all the mountains and oceans of ten buddhafields,

source: །ཆོས་འདིར་དད་པའི་བྱ་དཀའ་ཅི་འདྲ་བ། །དེ་འདྲ་དེ་ནི་དེ་ལ་ཡོད་མ་ཡིན།
en: That would be nothing compared with The difficult task of having faith in this Dharma.

source: །ལ་ལས་ཞིང་བཅུའི་རྡུལ་སྙེད་སེམས་ཅན་ལ། །དགེ་བ་ཀུན་གྱིས་བསྐལ་པར་བསྙེན་བཀུར་ཀྱང་།
en: “ ‘Though some people might, for an eon, serve with every virtue Sentient beings as numerous as the atoms of ten buddhafields,

source: །ལ་ལས་ཞིང་བཅུའི་རྡུལ་སྙེད་སངས་རྒྱས་རྣམས། །བདེ་བ་ཀུན་གྱིས་བསྐལ་པར་བསྙེན་བཀུར་བས། །གང་གིས་ཆོས་ཀྱི་ལེའུ་འདི་གཟུང་བྱས་པ། །བསོད་ནམས་དེ་ནི་དེ་བས་ཁྱད་པར་འཕགས།
en: “ ‘Even greater than serving buddhas As numerous as the atoms of ten buddhafields With every kind of happiness for an eon Is the merit of upholding this chapter of Dharma.’

source: །རྣམ་ཐར་དེ་དག་རབ་ཏུ་བསྟན་པའི་ཚེ།
en: “When these emancipations were taught,

source: །ཕྱོགས་བཅུའི་ཞིང་རྣམས་ཐམས་ཅད་གཡོས་པར་གྱུར།
en: All realms in all ten directions shook.

source: །བདུད་ཀྱི་གནས་རྣམས་མོག་མོག་བྱས་གྱུར་ཅིང་།
en: All māra realms were outshone,

source: །སྒྲ་རབ་ཕྱུང་བས་ངན་སོང་རབ་ཏུ་ཞི།
en: And with a great sound ringing out, the lower realms became calm.

source: །ཕྱོགས་བཅུ་ཀུན་གྱི་མི་ཡི་སེང་གེ་རྣམས།
en: “All the lords of humans in all ten directions

source: །དེ་དག་ཀུན་གྱིས་མངོན་པར་ཞལ་བསྟན་ཏེ།
en: Showed their faces

source: །ཕྱག་བརྐྱང་མཛད་ནས་ཡོན་ཏན་མཐའ་ཡས་པ།
en: And extending their hands, laid them

source: །བཟང་པོ་དཔལ་གྱི་མགོ་ལ་བཞག་པར་གྱུར།
en: Atop the head of Bhadraśrī, who possessed infinite qualities.

source: །ཕྱག་གི་མཐིལ་གྱིས་མགོ་ལ་བྱུག་མཛད་དེ།
en: “Rubbing his head with the palms of their hands,

source: །རྣམ་ཐར་འདི་དག་ལེགས་པར་བཤད་པ་ལེགས། །ཁྱོད་ཀྱིས་ལེགས་བསྟན་རྗེས་སུ་ངེད་དགྱེས་ཞེས། །སངས་རྒྱས་དེ་དག་ཀུན་གྱིས་གསུང་བརྗོད་དོ།
en: All those buddhas said: ‘Your excellent exposition of these emancipations is good. I rejoice in your excellent expression!’ ”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་བསྟན་པ་འདི་དག་བཀའ་སྩལ་ནས་ཅང་མི་གསུང་བར་གྱུར་ཏོ།
en: Then the Blessed One, having taught those verses, remained silent.

source: །དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གང་དག་འཁོད་པའི་ལྷ་ཐམས་ཅད་དང་། མི་དང་མི་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པས་འདི་ལེགས་པར་བཀའ་སྩལ་ཏོ།
en: All the gods in the realm of this world and the humans and non-human demigods said, “The Tathāgata has taught this so well!

source: །ཀྱེ་མ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་གཉིས་པ་འདི་མཛད་དོ།
en: O, the Tathāgata has turned a second wheel of Dharma!

source: །ཆོས་བསྟན་པ་འདི་སྔོན་མ་ཐོས་སོ།
en: We have never heard this Dharma teaching before.

source: །སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྙེད་པར་འགྱུར་བ་དེ་དག་ནི་ཤིན་ཏུ་དཀོན་ཏེ།
en: Very few sentient beings will obtain this Dharma discourse.

source: །སེམས་ཅན་དེ་དག་ནི་དགེ་བའི་རྩ་བ་ངན་ངོན་དང་ལྡན་པ་མ་ཡིན་ནོ།
en: Those sentient beings will not have miserable roots of merit.

source: །སེམས་ཅན་དེ་དག་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡིན་ནོ།
en: Those sentient beings have paid respectful service to many buddhas.

source: །སེམས་ཅན་དེ་དག་ནི་ལྷ་དང་བཅས་པ་བདུད་དང་བཅས་པ་ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་མཆོད་རྟེན་ལྟ་བུར་འགྱུར་ཏེ།
en: Those sentient beings will be like sacred stūpas in this world including its gods, its māras, and Brahmā.

source: དེ་དག་ནི་བདུད་དམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་སམ། རབ་ཏུ་བྱུང་བ་རྣམས་སམ། ཁྱིམ་ན་གནས་པ་རྣམས་སམ། དེ་བཞིན་དུ་རྒྱལ་པོ་རྣམས་སམ། བློན་པོ་ཆེན་པོ་རྣམས་སམ། ཁྱིམ་བདག་རྣམས་ཀྱིས་གཙེ་བར་མི་ནུས་སོ
en: They will be invulnerable to harm by Māra, by other gods of the māra class, or by monks or by laymen, and likewise not by kings, by ministers, or by householders.”

source: ་ཞེས་ཅ་ཅོ་དང་གཞའི་སྒྲ་ཕྱུང་ངོ་།
en: At this, a clamor and laughter were heard.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The venerable Subhūti said to the Blessed One,

source: །བཅོམ་ལྡན་འདས་མདོ་སྡེ་དཀོན་མཆོག་འདི་ལྟ་བུ་དག་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་རྙེད་པར་དཀའ་བ་ལགས་ཏེ།
en: “Blessed One, the appearance of such a jewel of the sūtras in the world is hard to find.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་མཐུས་ཆོས་འདི་ལྟ་བུ་ནི་འཇིག་རྟེན་དུ་བྱུང་ཞིང་དེ་བཞིན་གཤེགས་པའི་མཐུ་ཉིད་ཀྱིས་སེམས་ཅན་དེ་དག་གིས་ཀྱང་ཐོས་ལགས་སོ།
en: Nevertheless, through the power of the Tathāgata such a Dharma has appeared in the world, and solely through the power of the Tathāgata, those sentient beings also heard it.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྗགས་ཀྱི་དབང་པོ་ཕྱུང་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One, using his speech, said to the venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག
en: “Ānanda, retain this Dharma discourse! Hold it! Seize it! Learn it!”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Ānanda, after circumambulating the Blessed One three times, said,

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་ལགས་ཏེ།
en: “I will retain this Dharma discourse.

source: སླན་ཆད་མི་བསྒྱུད་པར་བགྱིད་དོ།
en: I shall see that it is not forgotten.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་ཀུན་དུ་བཟང་པོ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཉན་ཐོས་ཆེན་པོ་གཞན་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: Then, after the Blessed One had spoken, that full assembly of bodhisattvas, the bodhisattvas Samanta­bhadra and Mañjuśrī Kumāra­bhūta, and the elder Śāradvatī­putra, the other great śrāvakas, and the world with its gods, humans, asuras, and gandharvas all rejoiced, and they praised what the Blessed One had said.

source: །འཕགས་པ་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྫོགས་སོ།། །།
en: This Dharma teaching “The Dhāraṇī of the Jewel Torch” concludes here.

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Translated, checked, and verified by the Indian preceptor Surendra­bodhi and the chief editor and translator, Bandé Yeshé Dé.
